const translations = {

  ejemplo: '✦  *مثال على الاستخدام:*',
  nolink: '✦  *الرابط غير صالح...*',
  apino: '✦  *API معطل: (خطأ: X)...*',
  nobus: '✦  *لا توجد نتائج...*',
  replya: (value) => `ᗢ أجب على تنسيق *( ${value} )* للمتابعة.`,
  replyb: (value) => `ᗢ أجب على تنسيق *( ${value} )* وقدم اسمًا.`,
  
//Idiomas
  iselec: 'ᗢ اختر اللغة التي تريدها.',
  selci: (value) => `لقد اخترت اللغة *( ${value} )*, سيتم ترجمة نصوص البوت لك.`,
  
  //-- Errores
  falapi: '✦ نوع خطأ API:',
  noresult: '✦ تعذر الوصول إلى API...',
  unsolo: (value) => `✦ يمكنك فقط الرد على التنسيقات *( ${value} )*`,
  
  //-- Textos
  textoa: (value) => `روبوت آلي عبر *(${value})*, يمكنه الحصول على معلومات/بيانات أو مزايا أخرى لتوفير استخدام مفيد لجميع المستخدمين.`,
  textob: 'تعذر تحويل المحتوى...',
  textoc: 'لا توجد فئات أخرى...',
  textod: 'إذا كنت ستقوم بشراء، اتصل بمساعد أو بالمالك.',
  textoe: 'تم شراء الخوادم وفقًا للتفاصيل...',
  textof: 'أنت بالفعل مدير...',
  textog: 'لقد فاتك النص',
  exito: '✓ *تم التنفيذ بنجاح.*',
  
  //-- No
  nomenu: '📍 الأمر *[ قائمة ]* معطل...',
  noinfo: '📍 أوامر *[ معلومات ]* معطلة...',
  nodesca: '📍 أوامر *[ تنزيلات ]* معطلة...',
  nosearch: '📍 أوامر *[ بحث ]* معطلة...',
  nostick: '📍 أوامر *[ ملصقات ]* معطلة...',
  noconv: '📍 أوامر *[ محول ]* معطلة...',
  nologos: '📍 أوامر *[ شعارات ]* معطلة...',
  noreaction: '📍 أوامر *[ ردود فعل ]* معطلة...',
  norandom: '📍 أوامر *[ عشوائي ]* معطلة...',
  norpg: '📍 أوامر *[ أر بي جي ]* معطلة...',
  nogroup: '📍 أوامر *[ مجموعات ]* معطلة...',
  notienda: '📍 أوامر *[ متجر ]* معطلة...',
  noajustes: '📍 أوامر *[ إعدادات ]* معطلة...',
  noutils: '📍 أوامر *[ أدوات ]* معطلة...',
  nogacha: '📍 أوامر *[ غاتشا ]* معطلة...',
  nojuegos: '📍 أوامر *[ ألعاب ]* معطلة...',
  noias: '📍 أوامر *[ ذكاء اصطناعي ]* معطلة...',
  noplan: (value) => `📍 عذرًا، يجب عليك شراء خطة تشمل النسخة *[ ${value} ]*\n- استخدم *#plan* لعرض الخطط المتاحة...`,
  
  //-- Datos
  ulistado: '⫶☰ القائمة', // Árabe
  udesca: 'محمل',
  usearch: 'باحث',
  ugener: 'مولد',
  usuario: 'مستخدم',
  nombre: 'اسم',
  titulos: 'عنوان',
  duracion: 'مدة',
  publicado: 'نشر',
  updates: 'تحديث',
  resultados: 'نتائج',
  descrip: 'وصف',
  enlace: 'رابط',
  vistas: 'مشاهدات',
  peso: 'وزن',
  exportado: 'مصدّر',
  stickks: 'ملصقات',
  seguidor: 'متابعون',
  seguido: 'متابع',
  fuente: 'مصدر',
  tipo: 'نوع',
  paquete: 'حزمة',
  album: 'ألبوم',
  artista: 'فنان',
  creador: 'منشئ',
  canal: 'قناة',
  grupo: 'مجموعة',
  comunidad: 'مجتمع',
  
  //-- RPG / رسالة
  coffee: 'صندوق',
  mining: 'تعدين',
  work: 'عمل',
  aventure: 'مغامرة',
  pesca: 'صيد',
  jefe: 'زعيم',
  jefesub: 'زعيم فرعي',
  jefefinal: 'زعيم نهائي',
  piesas: 'كشف',
  inventario: 'مخزون',
  cartera: 'محفظة',
  
  //-- Handler
  proph: '✦ *لا يمكنك استخدام هذا الأمر...*',
  dAdminh: '✦ *مديرو البوت فقط...*',
  moderh: '✦ *المشرفون فقط...*',
  premh: '✦ *المستخدمون المميزون فقط...*',
  grupoh: '✦ *فقط في الدردشات الجماعية...*',
  privadoh: '✦ *فقط في الدردشات الخاصة...*',
  adminsh: '✦ *المشرفون فقط...*',
  bAdminh: '✦ *فقط إذا كان البوت مديرًا...*',
  registroh: '✦ *أضف اسمك إلى قائمة المستخدمين.*',
  amigosh: '✦ *الأصدقاء المسجلون فقط بواسطة @Farguts...*',
  estrich: '✦ *أمر مقيد...*',

  //-- RPG / عناصر
  fuego: 'نار',
  agua: 'ماء',
  aire: 'هواء',
  tierra: 'أرض',
  fragment: 'شظايا',
  mana: 'مانا',
  energy: 'طاقة',
  salud: 'صحة',
  poder: 'قوة',
  resistencia: 'مقاومة',
  fuerza: 'قوة',
  rapido: 'سرعة'

}

export default translations